Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.SetRebarShapeFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
This method will obtain a RebarShape from the input parameters and sets it into Rebar element.
First it will check if the input curves and other parameters match to an existing shape.
If matches will use it, otherwise will try to create it and will use it.
If the creation will also fail, will throw InvalidOperationException.
doc:
The document.
style:
The usage of the bar, "standard" or "stirrup/tie".
attachementType:
The attachement type - Interior or Exterior to cover.
curves:
The curves.
norm:
The normal to the plane that the rebar curves lie on.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
-or-
The curves are not lying in a plane.
-or-
The norm is not perpendicular to the curves plane.
-or-
startHook and endTreatmentTypeIdAtStart cannot both coexist.
-or-
endHook and endTreatmentTypeIdAtEnd cannot both coexist.
Since:
2018

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.UseRebarConstraintsToProduceVaryingBars
Identifies if the rebar constraints should be used to compute each bar in set (which can produce varying length bars).
Remarks:
If this is false, only the first bar will be computed based on constraints and all the other bars will be a copy of it, each in their respective positions within the set.
Only for the first bar in set the distance from its handle to the target in constraint is the offset value stored in the constraint.
If this is true, for each bar in set the constraints will be used to compute the bar.
For each bar in set the distance from its handle to the target in constraint is the offset value stored in the constraint.
Even if this property is set to true, the set may have all bars identical. An example of such case is when all handles' surfaces(planes) are parallel with constraint' target surface(plane)
Since:
2018